{
  "NAVBAR": {
    "HOME": "Start",
    "PUBLICATIONS": "Publikationen",
    "PROJECTS": "Projekte",
    "CV": "Lebenslauf",
    "CONTACT": "Kontakt"
  },
  "ABOUT": {
    "PICTURE_ALT": "Bild des Webseiten Entwicklers (Maximilian Hagn)",
    "HELLO": "Hallo Welt",
    "MAX": "Ich heiße Max",
    "SHORT_DESC": "Ich studieren und arbeite im Bereich der Computerwissenschaften und der Betriebswirtscahftslehre.",
    "LONG_DESC": "At the age of 14 I started to get involved with computer science and software development by moving to a technical high school. After graduating from this five year institution I already had a profound knowledge in this area and thus changed to a technical university to study first Business Informatics and later additionally Software and Information Engineering. Besides some internships in this field I worked for a computer company for three years and worked there in technical support and also developed a small website. Afterwards I changed to another company for which I am currently developing a productivity software."
  },
  "PROJECTS": {
    "HEADING": "Projekte",
    "INTRO_TEXT": "In this section you can find my previous software development projects. These projects are either tasks I had to do at school and university or private projects. For most of the projects the source code can be accessed, viewed and reused via GitHub. If projects are still actively hosted on my server, the website of the project is also listed. In the following you see a selection of my best projects, however, another tag can be selected via the dropdown menu.",
    "WEBSITE": "Webseite erkunden",
    "SOURCE": "Quellcode durchsuchen",
    "TOOLTIP_SEARCH": "Nach Schlagwort suchen"
  },
  "PUBLICATIONS": {
    "HEADING": "Publikationen",
    "INTRO_TEXT": "In my school and academic career I was already allowed to write some pre-scientific and scientific work, with which I could deepen my knowledge in the field of computer science. I wrote my most recent thesis in winter 2021 and as part of my bachelor thesis I developed an application that uses the abstract syntax tree provided by Clang and LLVM to analyze C++ programs and automatically insert performance counters at the critical regions of interest. My first pre-scientific work I developed in the course of my diploma thesis, a work that is required to obtain the title of Engineer in Austria. In this work we developed in a team of 5 people an E-Learning Platform based on a self-developed didactic concept. This platform should help young developers to dive faster into the world of web development. Furthermore, we have also developed many other concepts such as the creation of our own CSS framework, which is similar to the established frameworks \"Bootstrap\" or \"Tailwind\". Additional goals of the project included efficient project management and planning, as well as the creation of a marketing concept and our own brand. The abstracts of the papers and links to the websites such as the source code are provided below.",
    "BACHELOR": "Bachelorarbeit",
    "MASTER": "Masterarbeit",
    "DIPLOMA": "Diplomarbeit",
    "UNIVERSITY": "Technische Universität Wien",
    "SCHOOL": "Höhere Technische Lehranstalt Rennweg",
    "BOOK": "Buch herunterladen",
    "WEBSITE": "Webseite erkunden",
    "SOURCE": "Quellcode durchsuchen",
    "WEBSITE_INFO": "Information's Webseite",
    "WEBSITE_FRAMEWORK": "CSS Framework",
    "WEBSITE_E_LEARNING": "E-Learning Plattform",
    "BACHELOR_1_TITLE": "Erkennen von Leistungsengpässen mittels AST-Transformationen",
    "BACHELOR_1_TEXT_1": "Bei der Entwicklung von Software stehen viele Programmiererinnen und Programmierer früher oder später vor der Frage, wie sie ihre Anwendungen optimieren und damit auch die Laufzeit so kurz wie möglich halten können. Gerade im Bereich des Hochleistungsrechnens und bei der Entwicklung zeitkritischer Software ist die Verkürzung der Laufzeit von Programmen unabdingbar. Die Laufzeitanalyse ist daher eine grundlegende Technik, die jede Entwicklerin und jeder Entwickler beherrschen muss. Zu diesem Zweck wird der Quellcode entweder manuell überprüft oder die Anwendung während der Laufzeit mit Profiling-Tools analysiert. Diese Instrumente bieten den Benutzenden die Möglichkeit, Daten über die Leistung einzelner Funktionen zu erhalten. Bei den meisten Tools können die \\emph{interessierenden Bereiche}\\emph{(ROI)} in der Regel manuell festgelegt werden. Die Identifizierung dieser Bereiche kann problematisch sein, insbesondere bei der Entwicklung komplexer Programme. Daher wäre es wünschenswert, wenn es eine Methode gäbe, mit der benutzerdefinierte \\emph{Bereiche von Interesse} durch automatisches Einfügen von Messcode analysiert werden könnten.",
    "BACHELOR_1_TEXT_2": "In dieser Arbeit wird ein Werkzeug zur Leistungsmessung vorgestellt, das zur automatischen Messung der Laufzeiten kritischer Bereiche in \\C /\\CPP Anwendungen verwendet werden kann. Das entwickelte Werkzeug basiert auf dem von \\CLANG bereitgestellten Framework, das verschiedene Funktionen zum Traversieren von \\emph{abstrakten Syntaxbäumen}\\emph{(AST)} bietet. Das Werkzeug analysiert den von \\CLANG bereitgestellten \\emph{Syntaxbaum} des Eingabecodes und fügt automatisch Messcode an den gewünschten Stellen ein. Dazu wird der \\emph{abstrakte Syntaxbaum} von der Wurzel abwärts durchlaufen, wobei in jeder Iteration eine hierarchisch niedrigere Ebene von der Benutzerin oder dem Benutzer ausgewählt werden kann. In jeder Iteration erhält die oder der Anwendende Statistiken über die \\emph{interessierenden Bereiche} und kann selbst auf Basis der gewonnenen Informationen entscheiden, welcher Bereich als nächster analysiert werden soll. Um die Funktionalität des Programms vorzustellen werden wir den Arbeitsablauf an verschiedenen Beispielen demonstrieren. Des Weiteren wird anhand einer Überlaufanalyse gezeigt, dass der Überlauf des Profiling-Prozesses durch die iterative Vorgehensweise gering gehalten werden~kann.",
    "DIPLOMA_TITLE": "Creative Puzzle - Web Development E-Learning Plattform",
    "DIPLOMA_TEXT_1": "<em>Creative Puzzle</em> wants to encourage people with little prior knowledge to write web pages and provides assistance through playful exercises, ready-made learning templates and a code library. Learning by doing gives learners the opportunity to quickly familiarize themselves with various programming languages. An E-Learning platform especially for the 1st - 3rd classes of HTLs should be created. Most of the time, lower-level students find it difficult to identify the context of individual components of a documentary, and they find it difficult to manage with the many different commands. <em>Creative Puzzle</em> aims to facilitate the endless browsing of specifications by providing practice-related examples. These can be pre-made templates or playful exercises. In contrast to existing specified information websites, the commands are not explained individually, but web components are explained step by step and therefore presented in a practical way. So the relationship can be understood more easily.",
    "DIPLOMA_TEXT_2": "<em>Creative Puzzle</em> provides a sleek and simple framework and, above all, well-documented documentation. Several stylesheets with many predesigned templates will be available on the website. It also includes graphic elements to playfully learn web programming. Since the team from their own experience in the first HTL years could muster little motivation for the design of websites, one of the goals is to show the topicality of these techniques with a graphically appealing design. Additional the team has worked extensively with several other areas relevant to web development. On the one hand, concepts for the efficient host- ing of a website were designed, on the other hand Creative Puzzle would like to optimize its website according to the Search Engine Optimization guidelines. Another aim will be to enthuse young people for web programming. The project team is mainly concerned with the layout and design of website elements and with the specification. Furthermore, the team will present insights and issues that had to be learned, as well as tips that are relevant for writing a frame-work and for layouting a website. An additional goal is to promote the project and to draw attention to the result through innovative and complex designs of the advertising materials, such as posters, flyers, folders, business cards and cover pictures."
  },
  "CV": {
    "HEADING": "Lebenslauf",
    "TOOLTIP_MAIL": "E-Mail verfassen",
    "TOOLTIP_PHONE": "Telefonnummer anfragen",
    "TOOLTIP_ADDRESS": "Adresse anfragen",
    "PERSONAL": "Personelle Daten",
    "EDUCATION": "Ausbildung",
    "EMPLOYMENT": "Berufserfahrung",
    "RECOGNITIONS": "Anerkennungen und Auszeichnungen",
    "LANGUAGES": "Sprachen",
    "SKILLS_HEADING": "Kenntnisse",
    "TELEPHONE": "Telefonnummer anfragen",
    "ADDRESS": "Adresse anfragen",
    "BIRTHDAY": "Geburtstag: August 25, 1997",
    "BIRTHPLACE": "Geburtsort: Dresden, Deutschland",
    "CITIZENSHIP": "Staatsbürgerschaft: German",
    "RESIDENCE": "Wohnort: Vienna, Österreich",
    "UNIVERSITY": "Technische Universität Wien",
    "BUSINESS_INFORMATICS": "Studienrichtung Wirtschaftsinformatik",
    "SOFTWARE_ENGINEERING": "Studienrichtung Software & Information Engineering",
    "SCHOOL": "Höhere Technische Lehranstalt Rennweg, 1030 Vienna",
    "MEDIA_TECHNOLOGY": "Schwerpunkt Medientechnik",
    "MIDDLE_SCHOOL": "Gymnasium St. Ursula, 1230 Vienna",
    "ELEMENTARY_SCHOOL": "Volksschule Maurer Lange Gasse, 1230 Wien",
    "PRESENT": "Folgende",
    "AQILO_DESC": "Technischer Mitarbeiter, Teilzeit (20 Wochenstunden)",
    "AVALON_DESC_PT": "Softwareentwickler, Teilzeit (11 Wochenstunden)",
    "AVALON": "Avalon Computersystem GmbH",
    "SGEF_DESC_FP": "Buchhalter, Ferial-Praktikum (38.5 Wochenstunden)",
    "SGEF_DESC_NJ": "Buchhalter, Teilzeit (10 Wochenstunden)",
    "STIWA_DESC": "Softwareentwickler, Ferial-Praktikum (38.5 Wochenstunden)",
    "AVALON_DESC_FP": "Softwareentwickler, Ferial-Praktikum (38.5 Wochenstunden)",
    "LEADER_DIPLOMA": "Projektleiter der Diplomarbeit \"Creative Puzzle - Web Development E-Learning Platform\" (Benotung: Sehr Gut)",
    "PROJECT_CERTIFICATION": "IPMA - Projektmanagement Zertifizierung (jZpm)",
    "TEAM_BUILDING": "Kommunikation und Teambildung Seminar (34 Stunden)",
    "SIECAMS_LEADER": "Projektleiter eines informationstechnologischen Projektes (Produktflyer für den Service \"Siecams\" von Siemens AG) im Rahmen des Projektmanagement Unterrichts",
    "BSC_1": "Verleihung des akademischen Grades BSc (Erkennen von Leistungsengpässen mittels AST-Transformationen)",
    "HEAD_BOY": "Stellvertretender Abteilungssprecher und 3. im SGA (3. StV. Schulsprecher)",
    "LEADER_PROJECT": "Projektleiter eines informationstechnologischen Projektes im Rahmen des Projektmanagement Unterrichts",
    "HIGH_SCHOOL_REP": "Oberstufen Klassensprecher",
    "GERMAN": "Deutsch (Muttersprache)",
    "ENGLISH": "Englisch (Erste lebende Fremdsprache)"
  },
  "SKILLS": {
    "WORD_PROCESSORS": "Textverarbeitungsprogramme (Microsoft Word, Pages, Google Docs, LibreOffice Writer)",
    "SPREADSHEET": "Tabellenkalkulationsprogramme (Microsoft Excel, Numbers, Google Tabellen, LibreOffice Calc)",
    "PRESENTATION": "Präsentationsprogramme (Microsoft PowerPoint, Keynote)",
    "E_MAIL_PROGRAMS": "E-Mail Programme (Microsoft Outlook, Thunderbird)",
    "OPERATING_SYSTEMS": "Betriebssysteme (Linux, macOS, Windows)",
    "FRONT_END_DEVELOPMENT": "Webseiten-Design (HTML, CSS)",
    "BACK_END_DEVELOPMENT": "Webseiten-Funktionen (PHP / Laravel, JAVA / Spring Boot, C# / Blazor, Typescript / Angular, JavaScript)",
    "GENERAL_PURPOSE": "General Purpose Languages (C, C++, Perl, Java)",
    "APPLE_APPS": "Apple Applikationen (Xcode 9.0, Swift)",
    "NETWORK_ENGINEERING": "Netzwerktechnik",
    "NATIVE_APPS": "Native Applikationen (Cordova, Electron)",
    "COMPILERS": "Übersetzerbau (Lex / Flex, YACC / Bison, Ox, Burg / iBurg, LLVM, Clang)",
    "PROJECT_MANAGEMENT": "Projektmanagement (Lineare Modelle, Agile Methoden, IPMA)",
    "ORGANIZATIONAL": "Organisationstalent",
    "RESPONSIBILITY": "Verantwortungsbewusst",
    "TEAM_SPIRIT": "Teamfähigkeit",
    "COMMUNICATION": "Kommunikationsfähigkeit",
    "DETERMINATION": "Zielstrebigkeit",
    "LICENSES": "B und AM Führerschein, Motorboot Führerschein"
  },
  "CONTACT": {
    "HEADING": "Kontakt",
    "INTRO_TEXT": "Sie können mir gerne eine E-Mail schicken, wenn Sie Fragen zu mir oder meinen Projekten haben. Ich bin aber auch immer an freiberuflichen Angeboten interessiert.",
    "TOOLTIP_MAIL": "E-Mail verfassen",
    "TOOLTIP_PHONE": "Telefonnummer anfragen"
  }
}
